In [1]:
import pandas as pd 
import numpy as np
%matplotlib inline

In [2]:
pd.__version__

'1.2.4'

In [3]:
df = pd.read_excel('D:/STIMATA/SEMESTER 7/SISTEM CERDAS/UAS_SISTEM_CERDAS_SPADA/dataset_UAS-main/dataset_soal No. 2.xls')

In [4]:
df

  Category  Weather V-1  Holiday V-2  Game V-3  Qty
0        A            5            1         0  250
1        B            3            1         1  200
2        C            1            1         0   75
3        D            4            1         1  400
4        E            4            0         0  150
5        F            2            0         0   50

In [5]:
import math 
dis = []
for i in range(6):
    dis.append(math.sqrt((float(df.iloc[i]['Weather V-1'])-1)**2
                         +(float(df.iloc[i]['Holiday V-2'])- 0)**2
                         +(float(df.iloc[i]['Game V-3'])-0)**2))

In [6]:
df['dis'] = dis
df

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
0        A            5            1         0  250  4.123106
1        B            3            1         1  200  2.449490
2        C            1            1         0   75  1.000000
3        D            4            1         1  400  3.316625
4        E            4            0         0  150  3.000000
5        F            2            0         0   50  1.000000

In [7]:
df.sort_values('dis')

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
2        C            1            1         0   75  1.000000
5        F            2            0         0   50  1.000000
1        B            3            1         1  200  2.449490
4        E            4            0         0  150  3.000000
3        D            4            1         1  400  3.316625
0        A            5            1         0  250  4.123106

In [8]:
df.to_excel('D:/STIMATA/SEMESTER 7/SISTEM CERDAS/UAS_SISTEM_CERDAS_SPADA/Outputs_KNN_Nomer2a.xls')

<ipython-input-8-f9d8d6228066>:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df.to_excel('D:/STIMATA/SEMESTER 7/SISTEM CERDAS/UAS_SISTEM_CERDAS_SPADA/Outputs_KNN_Nomer2a.xls')

In [9]:
df.sort_values('dis').head(4)

  Category  Weather V-1  Holiday V-2  Game V-3  Qty      dis
2        C            1            1         0   75  1.00000
5        F            2            0         0   50  1.00000
1        B            3            1         1  200  2.44949
4        E            4            0         0  150  3.00000

In [10]:
y = df.sort_values('dis').head(4)

In [11]:
z = y["Qty"]
z

2     75
5     50
1    200
4    150
Name: Qty, dtype: int64

In [12]:
np.mean(z)

118.75